app/views/books/_index.html.erb

SELECT "books".* FROM "books" WHERE (category LIKE '%本%')
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
    </td>
    <td><p>コメント件数：<%= book.book_comments.count %></p></td>