app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book_new = Book.new
    @book = Book.find(params[:id])

SELECT "books".* FROM "books" ORDER BY created_at DESC
---
  def index
    @books = Book.all

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at", "rate", "category") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "本なんもないやん"], ["body", "何が起こった？"], ["user_id", 2], ["created_at", "2021-06-08 23:37:53.916601"], ["updated_at", "2021-06-08 23:37:53.916601"], ["rate", 3.0], ["category", "本"]]
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save