app/controllers/find_controller.rb

  def find
    @books = Book.find(params[:find])
---
SELECT "books".* FROM "books" WHERE (category LIKE '%本%')